geosmall/Arduino_STM32_LL/boards.txt
GenF7.menu.usb.none=None
GenF7.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenF7.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenF7.menu.usb.CDC=CDC (no generic 'Serial')
GenF7.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenF7.menu.usb.HID=HID (keyboard and mouse)
GenF7.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenF7.menu.xusb.FS=Low/Full Speed
GenF7.menu.xusb.HS=High Speed
GenF7.menu.xusb.HS.build.usb_speed=-DUSE_USB_HS
GenF7.menu.xusb.HSFS=High Speed in Full Speed mode
GenF7.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

GenH7.menu.usb.none=None
GenH7.menu.usb.CDCgen=CDC (generic 'Serial' supersede U(S)ART)
GenH7.menu.usb.CDCgen.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC
GenH7.menu.usb.CDC=CDC (no generic 'Serial')
GenH7.menu.usb.CDC.build.enable_usb={build.usb_flags} -DUSBD_USE_CDC -DDISABLE_GENERIC_SERIALUSB
GenH7.menu.usb.HID=HID (keyboard and mouse)
GenH7.menu.usb.HID.build.enable_usb={build.usb_flags} -DUSBD_USE_HID_COMPOSITE
GenH7.menu.xusb.FS=Low/Full Speed
GenH7.menu.xusb.HSFS=High Speed in Full Speed mode
GenH7.menu.xusb.HSFS.build.usb_speed=-DUSE_USB_HS -DUSE_USB_HS_IN_FS

# Optimizations
Flight_ctrl.menu.opt.ogstd=Debug (-g default)
Flight_ctrl.menu.opt.ogstd.build.flags.optimize=-g -Og
Flight_ctrl.menu.opt.osstd=Smallest (-Os)
Flight_ctrl.menu.opt.oslto=Smallest (-Os) with LTO
Flight_ctrl.menu.opt.oslto.build.flags.optimize=-Os -flto
Flight_ctrl.menu.opt.o1std=Fast (-O1)
Flight_ctrl.menu.opt.o1std.build.flags.optimize=-O1
Flight_ctrl.menu.opt.o1lto=Fast (-O1) with LTO
Flight_ctrl.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Flight_ctrl.menu.opt.o2std=Faster (-O2)
Flight_ctrl.menu.opt.o2std.build.flags.optimize=-O2
Flight_ctrl.menu.opt.o2lto=Faster (-O2) with LTO
Flight_ctrl.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Flight_ctrl.menu.opt.o3std=Fastest (-O3)
Flight_ctrl.menu.opt.o3std.build.flags.optimize=-O3
Flight_ctrl.menu.opt.o3lto=Fastest (-O3) with LTO
Flight_ctrl.menu.opt.o3lto.build.flags.optimize=-O3 -flto

Nucleo_64.menu.opt.ogstd=Debug (-g default)
Nucleo_64.menu.opt.ogstd.build.flags.optimize=-g -Og
Nucleo_64.menu.opt.osstd=Smallest (-Os)
Nucleo_64.menu.opt.oslto=Smallest (-Os) with LTO
Nucleo_64.menu.opt.oslto.build.flags.optimize=-Os -flto
Nucleo_64.menu.opt.o1std=Fast (-O1)
Nucleo_64.menu.opt.o1std.build.flags.optimize=-O1
Nucleo_64.menu.opt.o1lto=Fast (-O1) with LTO
Nucleo_64.menu.opt.o1lto.build.flags.optimize=-O1 -flto
Nucleo_64.menu.opt.o2std=Faster (-O2)
Nucleo_64.menu.opt.o2std.build.flags.optimize=-O2
Nucleo_64.menu.opt.o2lto=Faster (-O2) with LTO
Nucleo_64.menu.opt.o2lto.build.flags.optimize=-O2 -flto
Nucleo_64.menu.opt.o3std=Fastest (-O3)
Nucleo_64.menu.opt.o3std.build.flags.optimize=-O3
Nucleo_64.menu.opt.o3lto=Fastest (-O3) with LTO
Nucleo_64.menu.opt.o3lto.build.flags.optimize=-O3 -flto

GenF4.menu.opt.ogstd=Debug (-g default)
GenF4.menu.opt.ogstd.build.flags.optimize=-g -Og
GenF4.menu.opt.osstd=Smallest (-Os)
GenF4.menu.opt.osstd.build.flags.optimize=-Os
GenF4.menu.opt.oslto=Smallest (-Os) with LTO
GenF4.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF4.menu.opt.o1std=Fast (-O1)
GenF4.menu.opt.o1std.build.flags.optimize=-O1
GenF4.menu.opt.o1lto=Fast (-O1) with LTO
GenF4.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF4.menu.opt.o2std=Faster (-O2)
GenF4.menu.opt.o2std.build.flags.optimize=-O2
GenF4.menu.opt.o2lto=Faster (-O2) with LTO
GenF4.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF4.menu.opt.o3std=Fastest (-O3)
GenF4.menu.opt.o3std.build.flags.optimize=-O3
GenF4.menu.opt.o3lto=Fastest (-O3) with LTO
GenF4.menu.opt.o3lto.build.flags.optimize=-O3 -flto

GenF7.menu.opt.ogstd=Debug (-g default)
GenF7.menu.opt.ogstd.build.flags.optimize=-g -Og
GenF7.menu.opt.osstd=Smallest (-Os)
GenF7.menu.opt.osstd.build.flags.optimize=-Os
GenF7.menu.opt.oslto=Smallest (-Os) with LTO
GenF7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenF7.menu.opt.o1std=Fast (-O1)
GenF7.menu.opt.o1std.build.flags.optimize=-O1
GenF7.menu.opt.o1lto=Fast (-O1) with LTO
GenF7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenF7.menu.opt.o2std=Faster (-O2)
GenF7.menu.opt.o2std.build.flags.optimize=-O2
GenF7.menu.opt.o2lto=Faster (-O2) with LTO
GenF7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenF7.menu.opt.o3std=Fastest (-O3)
GenF7.menu.opt.o3std.build.flags.optimize=-O3
GenF7.menu.opt.o3lto=Fastest (-O3) with LTO
GenF7.menu.opt.o3lto.build.flags.optimize=-O3 -flto

GenH7.menu.opt.ogstd=Debug (-g default)
GenH7.menu.opt.ogstd.build.flags.optimize=-g -Og
GenH7.menu.opt.osstd=Smallest (-Os)
GenH7.menu.opt.oslto=Smallest (-Os) with LTO
GenH7.menu.opt.oslto.build.flags.optimize=-Os -flto
GenH7.menu.opt.o1std=Fast (-O1)
GenH7.menu.opt.o1std.build.flags.optimize=-O1
GenH7.menu.opt.o1lto=Fast (-O1) with LTO
GenH7.menu.opt.o1lto.build.flags.optimize=-O1 -flto
GenH7.menu.opt.o2std=Faster (-O2)
GenH7.menu.opt.o2std.build.flags.optimize=-O2
GenH7.menu.opt.o2lto=Faster (-O2) with LTO
GenH7.menu.opt.o2lto.build.flags.optimize=-O2 -flto
GenH7.menu.opt.o3std=Fastest (-O3)
GenH7.menu.opt.o3std.build.flags.optimize=-O3
GenH7.menu.opt.o3lto=Fastest (-O3) with LTO
GenH7.menu.opt.o3lto.build.flags.optimize=-O3 -flto

# C Runtime Library
Flight_ctrl.menu.rtlib.nano=Newlib Nano (default)
Flight_ctrl.menu.rtlib.nanofp=Newlib Nano + Float Printf
Flight_ctrl.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Flight_ctrl.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Flight_ctrl.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Flight_ctrl.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Flight_ctrl.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Flight_ctrl.menu.rtlib.full=Newlib Standard
Flight_ctrl.menu.rtlib.full.build.flags.ldspecs=

Nucleo_64.menu.rtlib.nano=Newlib Nano (default)
Nucleo_64.menu.rtlib.nanofp=Newlib Nano + Float Printf
Nucleo_64.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
Nucleo_64.menu.rtlib.nanofs=Newlib Nano + Float Scanf
Nucleo_64.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
Nucleo_64.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
Nucleo_64.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
Nucleo_64.menu.rtlib.full=Newlib Standard
Nucleo_64.menu.rtlib.full.build.flags.ldspecs=

GenF4.menu.rtlib.nano=Newlib Nano (default)
GenF4.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF4.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF4.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF4.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF4.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF4.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF4.menu.rtlib.full=Newlib Standard
GenF4.menu.rtlib.full.build.flags.ldspecs=

GenF7.menu.rtlib.nano=Newlib Nano (default)
GenF7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenF7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenF7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenF7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenF7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenF7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenF7.menu.rtlib.full=Newlib Standard
GenF7.menu.rtlib.full.build.flags.ldspecs=

GenH7.menu.rtlib.nano=Newlib Nano (default)
GenH7.menu.rtlib.nanofp=Newlib Nano + Float Printf
GenH7.menu.rtlib.nanofp.build.flags.ldspecs=--specs=nano.specs -u _printf_float
GenH7.menu.rtlib.nanofs=Newlib Nano + Float Scanf
GenH7.menu.rtlib.nanofs.build.flags.ldspecs=--specs=nano.specs -u _scanf_float
GenH7.menu.rtlib.nanofps=Newlib Nano + Float Printf/Scanf
GenH7.menu.rtlib.nanofps.build.flags.ldspecs=--specs=nano.specs -u _printf_float -u _scanf_float
GenH7.menu.rtlib.full=Newlib Standard
GenH7.menu.rtlib.full.build.flags.ldspecs=
